%pip install pandas

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\prati\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\prati\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\prati\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\prati\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\prati\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\prati\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [4]:
import numpy as np

In [7]:
mat1 = np.random.rand(5,6)
mat1

array([[0.77009281, 0.38310738, 0.35432538, 0.17140458, 0.22592438,
        0.56746947],
       [0.77584185, 0.60448193, 0.64288923, 0.89316094, 0.96607547,
        0.79829859],
       [0.87788072, 0.83870909, 0.41974883, 0.05975708, 0.50641374,
        0.38512925],
       [0.87447948, 0.69564039, 0.41897148, 0.89339228, 0.83790503,
        0.96176261],
       [0.64396118, 0.44827184, 0.92555159, 0.05877525, 0.78088826,
        0.74659868]])

In [8]:
pd.DataFrame(mat1)

          0         1         2         3         4         5
0  0.770093  0.383107  0.354325  0.171405  0.225924  0.567469
1  0.775842  0.604482  0.642889  0.893161  0.966075  0.798299
2  0.877881  0.838709  0.419749  0.059757  0.506414  0.385129
3  0.874479  0.695640  0.418971  0.893392  0.837905  0.961763
4  0.643961  0.448272  0.925552  0.058775  0.780888  0.746599

In [9]:
employees = {
    "names" : ["Alies","Bob","Charli"],
    "occupations" : ["Manger","CEO","Programer"],
    "Salary" : [100000,2000000,10000]
}
employees

{'names': ['Alies', 'Bob', 'Charli'],
 'occupations': ['Manger', 'CEO', 'Programer'],
 'Salary': [100000, 2000000, 10000]}

In [10]:
pd.DataFrame(employees)

    names occupations   Salary
0   Alies      Manger   100000
1     Bob         CEO  2000000
2  Charli   Programer    10000

In [12]:
employees_list = [{"name" : "Alice" , "occupation" : "Manager", "Salary" : 100000},
                    {"name" : "Bob" , "occupation" : "CEO", "Salary" : 2000000},
                    {"name" : "Charli" , "occupation" : "Programer", "Salary" : 10000}]
employees_list

[{'name': 'Alice', 'occupation': 'Manager', 'Salary': 100000},
 {'name': 'Bob', 'occupation': 'CEO', 'Salary': 2000000},
 {'name': 'Charli', 'occupation': 'Programer', 'Salary': 10000}]

In [13]:
pd.DataFrame(employees_list)

     name occupation   Salary
0   Alice    Manager   100000
1     Bob        CEO  2000000
2  Charli  Programer    10000

In [15]:
np.random.randint(1,50,size=(5,5))

array([[25, 22, 45, 21,  2],
       [22, 44, 35, 30, 42],
       [ 7,  6, 29, 43, 16],
       [36, 29, 38, 41, 48],
       [40, 25, 41, 10, 39]])

In [16]:
np.random.randint(1,50,size=(5,5))

array([[17,  2, 23, 29, 45],
       [19, 24, 37, 32,  4],
       [34,  8, 18, 39, 27],
       [49, 10, 36, 46, 31],
       [37, 17, 36,  3, 35]])

In [17]:
pd.DataFrame(np.random.randint(1,50,size=(5,5)))

    0   1   2   3   4
0  21  23  23  49  38
1  23  27  36  22  35
2  33   1  37  43  13
3  32  49  43   6  20
4  14  38  36  38  47

In [51]:
marks = pd.DataFrame(np.random.randint(1,50,size=(5,5)),columns = ["Math","Science","Martahi","Hindi","English"])
marks

   Math  Science  Martahi  Hindi  English
0    47        3       19     29        9
1    19       45       17     34       12
2    21       42        5      3       19
3     4       35       20     26       26
4    36       24       44     22        2

In [23]:
pd.DataFrame(np.random.randint(1,50,size=(5,5)),columns = ["Math","Science","Martahi","Hindi","English"],rows = ["stud1","stud2","stud3","stud4","stud5"])

TypeError: DataFrame.__init__() got an unexpected keyword argument 'rows'

In [24]:
pd.DataFrame(np.random.randint(1,50,size=(5,5)),columns = ["Math","Science","Martahi"])

ValueError: Shape of passed values is (5, 5), indices imply (5, 3)

In [40]:
pd.read_csv("Data/reviews - 3 SQL.csv")                 # read CSV files

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,2992450,7066586,01/07/14,86827297,Kristen,Large apartment; nice kitchen and bathroom. Ke...
1,2992450,21810844,24/10/14,22648856,Christopher,"This may be a little late, but just to say Ken..."
2,2992450,27434334,04/03/15,45406,Altay,The apartment was very clean and convenient to...
3,2992450,28524578,25/03/15,5485362,John,Kenneth was ready when I got there and arrange...
4,2992450,35913434,23/06/15,15772025,Jennifer,We were pleased to see how 2nd Street and the ...
...,...,...,...,...,...,...
24747,1201530000000000000,1236330000000000000,01/09/24,409566193,Francisco,My stay was great. Everyone was super friendly...
24748,1223420000000000000,1226880000000000000,19/08/24,32523819,Deborah,"The apartment was affordable, seemed clean, an..."
24749,1223420000000000000,1228290000000000000,21/08/24,573372093,Karissa,This was a good place to stay. I was just stay...
24750,1223420000000000000,1229840000000000000,23/08/24,3739918,Juan Carlos,If you need a place to crash for a day close t...
24751,1223980000000000000,1228320000000000000,21/08/24,348760882,Maribel,Great place. Amazing apartment. Clean and co...

In [32]:
pd.read_excel("Data/[DAF]  - LIP 1 Data (1).xlsx")                # read excel files

,Date,Description,Debit,Credit,Unnamed: 4,Sub-category,Category,Category Type
0,2024-01-09,Nextleap DAF,0,"₹120,000.00","₹120,000.00",Nextleap DAF,Salary,Income
1,2024-01-09,Drink,₹120.00,NaN,0,Coffee,Dining Out,Expense
2,2024-01-10,Flat Expenses,"₹21,600.00",NaN,0,Rent,Living Expenses,Expense
3,2024-01-10,EMI,"₹3,600.00",NaN,0,Cash loan,Transport,Expense
4,2024-01-10,Drink,₹120.00,NaN,0,Coffee,Dining Out,Expense
...,...,...,...,...,...,...,...,...
481,2024-11-03,Trainers,"₹3,211.20",NaN,0,Clothes,Discretionary,Expense
482,2024-11-03,Hangingout/Ticket,"₹4,425.60",NaN,0,Entertainment,Discretionary,Expense
483,2024-11-04,H&m Visit,"₹3,708.00",NaN,0,Clothes,Discretionary,Expense
484,2024-11-04,Ola,₹770.40,NaN,0,Taxi,Transport,Expense
485,2024-11-04,Foodary,₹360.00,NaN,0,Restaurant,Dining Out,Expense

In [33]:
pd.ExcelFile("Data/[DAF]  - LIP 1 Data (1).xlsx").sheet_names      # they give all sheet names in the excel file

['Sheet1',
 'clean_data',
 'discraptive staticts',
 'pivot table',
 'Dashborad',
 'insights']

In [34]:
pd.read_excel("Data/[DAF]  - LIP 1 Data (1).xlsx",sheet_name = "Sheet1")                 # read specifice files

,Date,Description,Debit,Credit,Unnamed: 4,Sub-category,Category,Category Type
0,2024-01-09,Nextleap DAF,0,"₹120,000.00","₹120,000.00",Nextleap DAF,Salary,Income
1,2024-01-09,Drink,₹120.00,NaN,0,Coffee,Dining Out,Expense
2,2024-01-10,Flat Expenses,"₹21,600.00",NaN,0,Rent,Living Expenses,Expense
3,2024-01-10,EMI,"₹3,600.00",NaN,0,Cash loan,Transport,Expense
4,2024-01-10,Drink,₹120.00,NaN,0,Coffee,Dining Out,Expense
...,...,...,...,...,...,...,...,...
481,2024-11-03,Trainers,"₹3,211.20",NaN,0,Clothes,Discretionary,Expense
482,2024-11-03,Hangingout/Ticket,"₹4,425.60",NaN,0,Entertainment,Discretionary,Expense
483,2024-11-04,H&m Visit,"₹3,708.00",NaN,0,Clothes,Discretionary,Expense
484,2024-11-04,Ola,₹770.40,NaN,0,Taxi,Transport,Expense
485,2024-11-04,Foodary,₹360.00,NaN,0,Restaurant,Dining Out,Expense

In [38]:
pd.read_excel("Data/[DAF]  - LIP 1 Data (1).xlsx",sheet_name = "clean_data")                 # read specifice files

,Date,Description,Debit,Credit,Sub-category,Category,Category Type,month,weekday,Unnamed: 9,...,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Debit.1
0,2024-01-09,Nextleap DAF,0.0,120000,Nextleap DAF,Salary,Income,Jan-2024,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0
1,2024-01-09,Drink,120.0,0,Coffee,Dining Out,Expense,Jan-2024,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,120.0
2,2024-01-10,Flat Expenses,21600.0,0,Rent,Living Expenses,Expense,Jan-2024,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,21600.0
3,2024-01-10,EMI,3600.0,0,Cash loan,Transport,Expense,Jan-2024,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3600.0
4,2024-01-10,Drink,120.0,0,Coffee,Dining Out,Expense,Jan-2024,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,120.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
481,2024-11-03,Trainers,3211.2,0,Clothes,Discretionary,Expense,Nov-2024,44,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3211.2
482,2024-11-03,Hangingout/Ticket,4425.6,0,Entertainment,Discretionary,Expense,Nov-2024,44,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4425.6
483,2024-11-04,H&m Visit,3708.0,0,Clothes,Discretionary,Expense,Nov-2024,45,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3708.0
484,2024-11-04,Ola,770.4,0,Taxi,Transport,Expense,Nov-2024,45,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,770.4
485,2024-11-04,Foodary,360.0,0,Restaurant,Dining Out,Expense,Nov-2024,45,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,360.0

In [44]:
df = pd.read_csv("Data/reviews - 3 SQL.csv")
df

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,2992450,7066586,01/07/14,86827297,Kristen,Large apartment; nice kitchen and bathroom. Ke...
1,2992450,21810844,24/10/14,22648856,Christopher,"This may be a little late, but just to say Ken..."
2,2992450,27434334,04/03/15,45406,Altay,The apartment was very clean and convenient to...
3,2992450,28524578,25/03/15,5485362,John,Kenneth was ready when I got there and arrange...
4,2992450,35913434,23/06/15,15772025,Jennifer,We were pleased to see how 2nd Street and the ...
...,...,...,...,...,...,...
24747,1201530000000000000,1236330000000000000,01/09/24,409566193,Francisco,My stay was great. Everyone was super friendly...
24748,1223420000000000000,1226880000000000000,19/08/24,32523819,Deborah,"The apartment was affordable, seemed clean, an..."
24749,1223420000000000000,1228290000000000000,21/08/24,573372093,Karissa,This was a good place to stay. I was just stay...
24750,1223420000000000000,1229840000000000000,23/08/24,3739918,Juan Carlos,If you need a place to crash for a day close t...
24751,1223980000000000000,1228320000000000000,21/08/24,348760882,Maribel,Great place. Amazing apartment. Clean and co...

In [45]:
df.head()

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,2992450,7066586,01/07/14,86827297,Kristen,Large apartment; nice kitchen and bathroom. Ke...
1,2992450,21810844,24/10/14,22648856,Christopher,"This may be a little late, but just to say Ken..."
2,2992450,27434334,04/03/15,45406,Altay,The apartment was very clean and convenient to...
3,2992450,28524578,25/03/15,5485362,John,Kenneth was ready when I got there and arrange...
4,2992450,35913434,23/06/15,15772025,Jennifer,We were pleased to see how 2nd Street and the ...

In [48]:
df.tail()

,listing_id,id,date,reviewer_id,reviewer_name,comments
24747,1201530000000000000,1236330000000000000,01/09/24,409566193,Francisco,My stay was great. Everyone was super friendly...
24748,1223420000000000000,1226880000000000000,19/08/24,32523819,Deborah,"The apartment was affordable, seemed clean, an..."
24749,1223420000000000000,1228290000000000000,21/08/24,573372093,Karissa,This was a good place to stay. I was just stay...
24750,1223420000000000000,1229840000000000000,23/08/24,3739918,Juan Carlos,If you need a place to crash for a day close t...
24751,1223980000000000000,1228320000000000000,21/08/24,348760882,Maribel,Great place. Amazing apartment. Clean and co...

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24752 entries, 0 to 24751
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   listing_id     24752 non-null  int64
 1   id             24752 non-null  int64
 2   date           24752 non-null  object
 3   reviewer_id    24752 non-null  int64
 4   reviewer_name  24752 non-null  object
 5   comments       24745 non-null  object
dtypes: int64(3), object(3)
memory usage: 1.1+ MB

In [49]:
df.describe()

         listing_id            id   reviewer_id
count  2.475200e+04  2.475200e+04  2.475200e+04
mean   1.894834e+17  6.209818e+17  1.990340e+08
std    3.527101e+17  4.439696e+17  1.656979e+08
min    2.992450e+06  7.066586e+06  2.830000e+02
25%    2.465578e+07  7.225961e+08  5.354391e+07
50%    4.239137e+07  7.108385e+17  1.542197e+08
75%    5.412883e+07  1.000072e+18  3.387387e+08
max    1.223980e+18  1.238480e+18  5.982480e+08

In [52]:
marks.values

array([[47,  3, 19, 29,  9],
       [19, 45, 17, 34, 12],
       [21, 42,  5,  3, 19],
       [ 4, 35, 20, 26, 26],
       [36, 24, 44, 22,  2]])

In [55]:
df.columns

Index(['listing_id', 'id', 'date', 'reviewer_id', 'reviewer_name', 'comments'], dtype='object')

In [56]:
[ i for i in df.columns if i.startswith("r")]

['reviewer_id', 'reviewer_name']

In [57]:
df.index

RangeIndex(start=0, stop=24752, step=1)

In [63]:
df.id

0                    7066586
1                   21810844
2                   27434334
3                   28524578
4                   35913434
                ...
24747    1236330000000000000
24748    1226880000000000000
24749    1228290000000000000
24750    1229840000000000000
24751    1228320000000000000
Name: id, Length: 24752, dtype: int64

In [60]:
df["id"]

0                    7066586
1                   21810844
2                   27434334
3                   28524578
4                   35913434
                ...
24747    1236330000000000000
24748    1226880000000000000
24749    1228290000000000000
24750    1229840000000000000
24751    1228320000000000000
Name: id, Length: 24752, dtype: int64

In [61]:
df["id"].dtype

dtype('int64')

In [62]:
type(df["id"])

pandas.core.series.Series

In [67]:
random_df = pd.DataFrame(np.random.rand(25,4))
random_df.columns

RangeIndex(start=0, stop=4, step=1)

In [73]:
marks_df = pd.DataFrame(np.random.randint(1,100,size=(25,4)),columns= ["math", "science" ,"hist","geo"])
marks_df.columns

Index(['math', 'science', 'hist', 'geo'], dtype='object')

In [74]:
marks_df.math.head()

0    71
1    29
2    94
3    47
4     8
Name: math, dtype: int32

In [75]:
random_df.1

SyntaxError: invalid syntax (4130470747.py, line 1)

In [78]:
random_df[1].head()

0    0.010509
1    0.846551
2    0.560483
3    0.224689
4    0.432593
Name: 1, dtype: float64

In [84]:
marks_df.loc[1]         # get a whole row of index 1

math       29
science    92
hist       73
geo        30
Name: 1, dtype: int32

In [81]:
type(marks_df.loc[1])

pandas.core.series.Series

In [85]:
marks_df.loc[1,0]         # get a whole row and column value index row= 1 and column= 0 -> error because loc are based on name of the rows and columns

KeyError: 0

In [102]:
marks_df.iloc[1,0]         # get a whole row and column value index row= 1 and column= 0 ->output because iloc are based on int value of row/column -> 1th row and 0th column in data frame

29

In [86]:
marks_df.loc[1,"math"]         # get a whole row and column value index row= 1 and column= math

29

In [87]:
random_df.head()

          0         1         2         3
0  0.414095  0.010509  0.143599  0.221345
1  0.045824  0.846551  0.915811  0.177553
2  0.528497  0.560483  0.701909  0.919570
3  0.261089  0.224689  0.922675  0.889945
4  0.839380  0.432593  0.471752  0.437154

In [90]:
random_df.loc[1,1]                  # get a whole row and column value index row= 1 and column= 1   -> it give value beacuse column name is 1

0.8465513699795882

In [93]:
random_df.loc["1","1"]                  # get a whole row and column value index row= 1 and column= 1   -> error becuase row and column name is i int value not a string

KeyError: '1'

In [94]:
random_df.index

RangeIndex(start=0, stop=25, step=1)

In [99]:
random_df.loc[7,3]

0.6741537292753533

In [100]:
random_df.iloc[7,3]

0.6741537292753533